## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

- Successfully Installed... : 최초 설치
- Requiremnet already satisfied... : 이미 설치됨

In [26]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
```python
import pandas as pd
```

In [27]:
import pandas as pd

### 판다스 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터묶음
- 열(column) 유니크 데이터의 하나하나 특성

In [28]:
## 딕셔너리로 DataFrame 객체 생성
data = {'이름': ['성명건', '홍길동', '애슐리'], '나이': [47, 20, 40], '결혼': [True, False, True]}
df = pd.DataFrame(data=data)
df

    이름  나이     결혼
0  성명건  47   True
1  홍길동  20  False
2  애슐리  40   True

In [29]:
## 2차원 리스트 생성
data = [['성명건', 47, '부산', 'smg@naver.com', True], ['홍길동', 20, '서울', 'hgd@gmail.com', False],
        ['애슐리', 40, '경기', 'ashley@nate.com', True], ['홍길순', 18, '서울', 'hgs@daum.net', False]]

data

[['성명건', 47, '부산', 'smg@naver.com', True],
 ['홍길동', 20, '서울', 'hgd@gmail.com', False],
 ['애슐리', 40, '경기', 'ashley@nate.com', True],
 ['홍길순', 18, '서울', 'hgs@daum.net', False]]

In [30]:
## 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소', '이메일', '결혼'])
df

    이름  나이  주소              이메일     결혼
0  성명건  47  부산    smg@naver.com   True
1  홍길동  20  서울    hgd@gmail.com  False
2  애슐리  40  경기  ashley@nate.com   True
3  홍길순  18  서울     hgs@daum.net  False

In [37]:
## 데이터프레임에서 데이터 조회(열) - 리스트는 for문을 써야지 출력가능
df['이름']

0    성명건
1    홍길동
2    애슐리
3    홍길순
Name: 이름, dtype: object

In [80]:
df['나이']

0    47
1    20
3    18
4    32
Name: 나이, dtype: int64

In [38]:
## 데이터프레임 조회(두개 열)
df[['이름', '나이']]

    이름  나이
0  성명건  47
1  홍길동  20
2  애슐리  40
3  홍길순  18

In [43]:
## 데이터프레임 행으로 조회
df.loc[0]

이름               성명건
나이                47
주소                부산
이메일    smg@naver.com
결혼              True
Name: 0, dtype: object

In [45]:
## 데이터프레임 조회(행)
df.loc[[1, 3]]

    이름  나이  주소            이메일     결혼
1  홍길동  20  서울  hgd@gmail.com  False
3  홍길순  18  서울   hgs@daum.net  False

In [47]:
# 현재 데이터프레임 확인
df

    이름  나이  주소              이메일     결혼
0  성명건  47  부산    smg@naver.com   True
1  홍길동  20  서울    hgd@gmail.com  False
2  애슐리  40  경기  ashley@nate.com   True
3  홍길순  18  서울     hgs@daum.net  False

In [48]:
## 새 컬럼 추가
df['전번'] = ['010', '011', '017', '019']

In [49]:
# 추가된 데이터프레임 확인
df

    이름  나이  주소              이메일     결혼   전번
0  성명건  47  부산    smg@naver.com   True  010
1  홍길동  20  서울    hgd@gmail.com  False  011
2  애슐리  40  경기  ashley@nate.com   True  017
3  홍길순  18  서울     hgs@daum.net  False  019

In [53]:
## 열 삭제, axis=0(행), 1(열)
df.drop('결혼', axis=1)

    이름  나이  주소              이메일   전번
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
3  홍길순  18  서울     hgs@daum.net  019

In [ ]:
## drop()은 삭제하고 출력만해줌. 완전히 삭제하려면 inplace 옵션을 사용
# inplace를 화면에 출력안됨
df.drop('결혼', axis=1, inplace=True) # 열로 삭제하려면 axis=1만 사용

In [57]:
# 삭제를 확인
df

    이름  나이  주소              이메일   전번
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
3  홍길순  18  서울     hgs@daum.net  019

In [65]:
## 행추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gmail.com', '020']

In [66]:
df

    이름  나이  주소              이메일   전번
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
3  홍길순  18  서울     hgs@daum.net  019
4  손흥민  32  런던    shm@gmail.com  020

In [68]:
## 행삭제, 완전히 삭제할려면 inplace쓰거나 아니면 변수에 재할당
df2 = df.drop(3)

In [69]:
df2

    이름  나이  주소              이메일   전번
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
4  손흥민  32  런던    shm@gmail.com  020

In [72]:
## 행삭제 inplace, 행삭제 시는 axis=0만 사용 또는 생략
df.drop(2, axis=0, inplace=True)

In [73]:
df

    이름  나이  주소            이메일   전번
0  성명건  47  부산  smg@naver.com  010
1  홍길동  20  서울  hgd@gmail.com  011
3  홍길순  18  서울   hgs@daum.net  019
4  손흥민  32  런던  shm@gmail.com  020

In [77]:
## 열 이름을 변경
df.rename(columns={'전번':'휴대폰'}, inplace=True)

In [78]:
df

    이름  나이  주소            이메일  휴대폰
0  성명건  47  부산  smg@naver.com  010
1  홍길동  20  서울  hgd@gmail.com  011
3  홍길순  18  서울   hgs@daum.net  019
4  손흥민  32  런던  shm@gmail.com  020

- 데이터프레임은 파이썬의 2차원 리스트와 동일하지만, 좀더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들 그루핑한게 데이터프레임
- 가장 최소단위

In [79]:
data = [47, 20, 40, 18, 32]
srs = pd.Series(data=data)
srs

0    47
1    20
2    40
3    18
4    32
dtype: int64

In [82]:
## 데이터프레임의 한 열을 가지고온 자료구조와 시리즈는 동일
type(df['나이'])

pandas.core.series.Series

In [83]:
type(srs)

pandas.core.series.Series

In [86]:
srs = pd.Series(data=data, index=['성명건', '홍길동', '애슐리', '홍길순', '손흥민'])
srs

성명건    47
홍길동    20
애슐리    40
홍길순    18
손흥민    32
dtype: int64

In [89]:
## 조회
srs['손흥민']

32

In [91]:
## 값 변경
srs['성명건'] = 48

In [92]:
srs

성명건    48
홍길동    20
애슐리    40
홍길순    18
손흥민    32
dtype: int64

In [96]:
## 데이터프레임에서 한 행을 가져와도 시리즈.
df.loc[1]

이름               홍길동
나이                20
주소                서울
이메일    hgd@gmail.com
휴대폰              011
Name: 1, dtype: object

#### 데이터프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer를 설치

In [98]:
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8')
df_csv

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241
3             A31         남성        319        299
4             A31         여성         42         54
5             A18         남성     158912     124486
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN